trade/src/InformationRegisters/ИнструкцииНоменклатуры/ИнструкцииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнструкцииНоменклатуры</name>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Файл</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/ИнструкцииНоменклатуры/ManagerModule.bsl
Функция ПолучитьВыборкуИнструкций(мНоменклатуры) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Номенклатура.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ ВидыНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&мНоменклатуры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнструкцииНоменклатуры.Номенклатура КАК Номенклатура,
	|	ИнструкцииНоменклатуры.Файл КАК Файл,
	|	ИнструкцииНоменклатуры.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ Инструкции
	|ИЗ
	|	РегистрСведений.ИнструкцииНоменклатуры КАК ИнструкцииНоменклатуры
	|ГДЕ
	|	ИнструкцииНоменклатуры.Номенклатура В(&мНоменклатуры)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыНоменклатуры.Номенклатура,
	|	ИнструкцииНоменклатуры.Файл,
	|	ИнструкцииНоменклатуры.Приоритет
	|ИЗ
	|	ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИнструкцииНоменклатуры КАК ИнструкцииНоменклатуры
	|		ПО ВидыНоменклатуры.ВидНоменклатуры = ИнструкцииНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Инструкции.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(Инструкции.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_СверткаПоПриоритету
	|ИЗ
	|	Инструкции КАК Инструкции
	|
	|СГРУППИРОВАТЬ ПО
	|	Инструкции.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СверткаПоПриоритету.Номенклатура КАК Номенклатура,
	|	ВТ_СверткаПоПриоритету.Приоритет КАК Приоритет,
	|	Инструкции.Файл КАК Файл
	|ИЗ
	|	ВТ_СверткаПоПриоритету КАК ВТ_СверткаПоПриоритету
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Инструкции КАК Инструкции
	|		ПО ВТ_СверткаПоПриоритету.Номенклатура = Инструкции.Номенклатура
	|			И ВТ_СверткаПоПриоритету.Приоритет = Инструкции.Приоритет";
	
	Запрос.УстановитьПараметр("мНоменклатуры", мНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ= РезультатЗапроса.Выгрузить();
	
	мФайлов= ТЗ.ВыгрузитьКолонку("Файл");
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат мФайлов;
КонецФункции
